org/03-magical-realm.org
#+SETUPFILE: setup.xorg

*Author's Note*: If you are among my approximately-2 readers who read
this story in its pre-release state: chapters 1 and 2 have been
combined and chapter 3 is now chapter 2, with a little extra on
the end.

