html/03-magical-realm.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">I'm Taking You Away to my Magical Realm</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>July 2009</b>
</p>

<p>
"Oriko-onee-chan!!!" The little girl in green ran through the hall,
and wrapped her arms around Oriko.
</p>

<p>
"Ah, Yuma-chan!"
</p>

<p>
"You're back!"
</p>

<p>
"Mmm-hmm. Right when I said I'd be back, right?"
</p>

<p>
Yuma nodded. "Right. It's exactly when. And Kirika is back too."
</p>

<p>
"Yep. She's gone to her room already."
</p>

<p>
"Is Hinata-san back yet?" asked Oriko.
</p>

<p>
"Don't you <i>knoow</i> if she's back?" asked Yuma.
</p>

<p>
Oriko shook her head No. "I only ever know things that are <i>going</i> to
happen, silly. I don't know everything that's going on right now."
</p>

<p>
"Well," said Yuma, taking a deep breath, "Aina-senpai got back, and,
and, Miroko-senpai did some magic in the hallway and trapped her in a
giant ice cube and she said, she said, I've got you now, and, I'm
taking you away to my magical realm, and, I'm going to have my way
with &#x2026;"
</p>

<p>
"Oh my," interrupted Oriko, "I hope you stayed out of their way;
that's &#x2026; a little bit of trouble."
</p>

<p>
"Yes! Trouble! The ice cube melted, and, there's a big, big, very big
puddle, alll over the floor."
</p>

<p>
"Goodness." said Oriko. "That won't do either. I hope you were on
better behavior yourself, though."
</p>

<p>
"Mmm-hmm!" nodded Yuma, energetically. "I missed you though. Hey did
my magic work?"
</p>

<p>
"It worked perfectly, of course." She scooped the little girl up in
her arms, for a hug. "You're a magical genius, didn't you know?"
</p>

<p>
Yuma stuck out her tongue. "You keep saying that, but it's really
really hard."
</p>

<p>
"Mmm-hmm. Hard work is behind every paragon of excellence in this
world. Hard hard work. You're good at that, and you're really smart,
and you have a <i>beautiful</i> imagination."
</p>

<p>
Yuma made a face. "Plus I'm super cute."
</p>

<p>
Oriko nodded. "Plus, you're super cute. And ticklish."
</p>

<p>
"Noooo!" squealed Yuma. "No tickles."
</p>

<p>
"Okay, no tickles. Do you want to pick our new story tonight?"
</p>

<p>
"No, you pick!"
</p>

<p>
"Oh, okay." Oriko pondered a moment, scanning the shelves. "I have
just the thing. <i>The Secret Garden</i>."
</p>

<hr  />

<p>
Homura was having a bad morning when the delinquent showed up.
</p>

<p>
"How's it hanging, homu-slice?"
</p>

<p>
"In the interests of group harmony, I am going to pretend I didn't
hear that, Sakura-san."
</p>

<p>
It was early in the morning, Kyoko was in the school uniform that she
wore when she was pretending to have business on campus.
</p>

<p>
"Aww. You're just no fun anymore, Homura."
</p>

<p>
"We missed you these past weeks," said Homura, as flatly as ever. "We
had speculated that you might have been at the beach."
</p>

<p>
"I - wait, now how'd you know that?"
</p>

<p>
"It is no use, Sakura-san. We have your number."
</p>

<p>
"Are you saying I'm predictable?"
</p>

<p>
"In the interests of group harmony, I would prefer to phrase it in a
manner that underscores the strength of our working relationship."
</p>

<p>
"Hey, I'll have you know that I do lots of unpredictable things."
</p>

<p>
"I'm quite sure. Will you be staying with us for a while, then?"
</p>

<p>
"I guess? I mean I haven't -"
</p>

<p>
"Enjoy your stay, then. We'll be starting the hunt from the usual
spot. Let us know in advance if we should wait for you."
</p>

<p>
Kyoko said nothing.
</p>

<p>
A few seconds passed.
</p>

<p>
"&#x2026; I must admit, you have surprised me here, Kyoko. I would have
predicted another complaint about my attitude."
</p>

<p>
"Yeah, well, in the interest of group harmony, um, I suppose I can cut
you some slack."
</p>

<p>
"Thank you. I appreciate it. Despite the facade of a cheery demeanor
that I present the world, I am not having a good morning."
</p>

<p>
"Right," said Kyoko, pausing. "Anything I can do to make it better?"
</p>

<p>
"I'd greatly appreciate just talking business for the time being."
</p>

<p>
"Right. Well, I'll meet you guys at sundown, I guess? I'm a little low
on cubes. Not badly, though. Will grab dinner ahead of time."
</p>

<p>
"Mmm-hmm."
</p>

<p>
"Hey, speaking of dinner, how's Team Psycho treating you of late?"
</p>

<p>
"Better than expected. They're busy bothering everybody else."
</p>

<p>
"Oh, that's&#x2026; good, I guess."
</p>

<p>
"What does that have to do with dinner?"
</p>

<p>
"Oh, funny story. I went by my old place in Kazamino before the beach,
and who do you think I run into?"
</p>

<p>
"A takoyaki vendor?" asked Homura.
</p>

<p>
"Nope! None other but the elusive Mikuni Oriko, herself, in the
flesh. Just sitting around, waiting to talk to me."
</p>

<p>
Homura took a moment to consider that. "This does not bode well."
</p>

<p>
"No, it all turns out okay. We talk for a while, she invites me over
to dinner, and of course because it's Oriko she's all like 'just come
whenever, I'll be expecting you, because FORESIGHT.' Anyway, it was
actually a real nice little talk."
</p>

<p>
"What did you talk about?"
</p>

<p>
Kyoko grinned. "Architecture."
</p>

<p>
"No, seriously."
</p>

<p>
"Seriously architecture. Didn't predict that one, did you?"
</p>

<p>
Homura tilted her head a bit to the side.
</p>

<p>
"Religious architecture, if it helps. A comparative study. She got me
to totally nerd out; it was awesome."
</p>

<p>
"Oriko is bad news," said Homura, carefully, "and is probably up to no
good. If I were you, I'd stay away."
</p>

<p>
"And what makes you the big expert on who's such bad news?"
</p>

<p>
"We &#x2026; have a history. It's not particularly pleasant. I prefer not
talking about it."
</p>

<p>
"Sure. I suppose I can leave that be. <i>In the interest of group
harmony.</i>"
</p>

<p>
"Thank you. I appreciate it."
</p>

<p>
"But I'm going anyway."
</p>

<p>
"Why?"
</p>

<p>
Kyoko signed. "Put yourself in my shoes for a minute, Homura. I mean,
living outside the system is an okay deal for a magical girl. You've
got lots of extra time to hunt, you can do whatever you want, it's
<i>fun</i>. But you know what I really miss sometimes? A decent homemade
meal. If there were a way to turn grief cubes into cash, I'd dine out,
but I've got enough problems already. I don't want to be one of those
girls who gets caught emptying ATMs and runs out of cubes in jail."
</p>

<p>
"Kyoko," said Homura, "I realize that this may sound a little
far-fetched, but I do actually care about your well-being. The Southern
Group is far more dangerous than the police, and Oriko is the worst
of them. Visit at your peril."
</p>

<p>
"I'm touched," said Kyoko, and only a little sarcastically. "Well,
I'll see you tonight, then, Akemi-san."
</p>

<p>
"Farewell, Kyoko."
</p>

<p>
Homura joined the crowd heading into class. It was annoying; she'd
actually arrived a little earlier today, in hopes of avoiding people.
Especially people like &#x2026;
</p>

<p>
"Homura-chan!" called a voice.
</p>

<p>
<i>Hitomi is a friend. Madoka would want it that way</i>, she reminded
herself, taking a moment to breathe.
</p>

<p>
"Good morning, Shizuki-san. I'm sorry I can't talk, I'm running a
little late," said Homura chan. <i>Well, she's doing better</i>, thought
Homura.
</p>

<p>
"After school, then?"
</p>

<p>
"I'm afraid I have plans. Another time, maybe," replied Homura,
turning to avoid her.
</p>

<p>
<i>Please, Homura-chan,/ thought Hitomi. /It's important.</i>
</p>

<p>
On the steps to the school, in front of a crowd of a hundred, Akemi
Homura, the calm girl, the coordinated girl, prefecture champion of
the pole vault, spun around too fast, tripped down the stairs, and
planted her face on the concrete sidewalk.
</p>

<p>
A cry went out from the crowd.
</p>

<p>
"Whoa!!"
</p>

<p>
"What the -"
</p>

<p>
"Is she okay? Call the nurse!"
</p>

<p>
Hitomi blinked several times. "Akemi &#x2026; san?"
</p>

<p>
"Why&#x2026; just&#x2026;" She propped herself up.
</p>

<hr  />

<p>
<i>Mami. Can't handle this. Send help.</i>
</p>

<p>
<i>What? What's wrong?</i> she replied.
</p>

<p>
"&#x2026; just <i>wiped out</i> on the stairs!" said a student, rounding the
corner.
</p>

<p>
<i>Front of school. Our friend, Shizuki Hitomi.</i>
</p>

<p>
<i>Oh my goodness, is she all right?</i> asked Mami, already hurrying in
that direction.
</p>

<p>
<i>What? No, she's fine, but I need to go put on a show for the nurse's
office.</i>
</p>

<p>
<i>I'm not sure I understand</i>, she said, reaching the front entryway,
and edging her way through a bit of a crowd. She wasn't quite sure
what to expect, but Homura picking herself off the pavement was not
it.
</p>

<p>
"No, no, I'm fine, I was just startled," said Homura to a mousey
little girl who was crouching beside her.
</p>

<p>
"Well, just to be safe you should stay put anyway. A concussion is
serious business. I won't have you taking any chances on my watch,"
replied her attendant.
</p>

<p>
"Ah, Nakihara-san, I think she'll be okay," said Hitomi to the
over-eager health rep. She tentatively walked forward to the pair.
</p>

<p>
"I don't have a concussion," said Homura. <i>Spare me</i>, she sent to
Mami. <i>I do not need another health representative in my life right
now.</i>
</p>

<p>
<i>Are you okay, Homura-chan?</i> asked a confused Mami.
</p>

<p>
<i>Please, just end me now</i>, said Homura, glaring up at Hitomi.
</p>

<p>
Mami looked up at Hitomi, and saw the fluffy white animal now perched
on Hitomi's shoulder. <i>Oh. Oh!</i>
</p>

<p>
<i>Miss Tomoe, this is Miss Shizuki</i>, she sent to both girls, <i>and in
the interest of group harmony, I will leave you two with each other.</i>
</p>

<p>
<i>Ah, good morning~</i>, replied Hitomi, sheepishly.
</p>

<p>
<i>Four hours after I warned her</i>, sent Homura. <i>Four.</i>
</p>

<hr  />

<p>
Kyoko was having second thoughts. What if this was a bad idea? An
ambush? <i>But if they'd wanted an ambush, though</i>, she thought, <i>she
could have surprised me at the church.</i>
</p>

<p>
Still. There was something unsettling about the idea that Oriko would
be <i>expecting</i> her in advance. It was rather like Homura calling her
predictable, except even more so. It was almost a question of free
will.
</p>

<p>
Actually, it was exactly a question of free will. /Which is something
Dad was always ambivalent about,/ considered Kyoko, moodily. Somehow
the question seemed more real coming from Oriko than from an
omniscient god, though.
</p>

<p>
<i>I'm distracted</i>, she realized, <i>and I should be keeping an eye out,/
/in case of any surprises.</i> Was that just the breeze, or was there a
rustling sound in the hedge -
</p>

<p>
she spun around, transforming, and spied the attacker, but it was too
late, and -
</p>

<p>
"Gotcha!" said a small voice as Kyoko felt someone grabbing her by the
legs.
</p>

<p>
"Bwuaua?"
</p>

<p>
A little girl with green hair had leapt out of the bushes and attached
herself to Kyoko's leg. <i>Oh, this one</i>, she thought. What was her name
again? They'd bumped into each other on patrol before. She was pretty
cute, actually.
</p>

<p>
"Um&#x2026; hi?"
</p>

<p>
"Got ya!"
</p>

<p>
Kyoko sighed, exhaled, de-transformed. "You shouldn't sneak up on
people like that. I could have hurt you by mistake."
</p>

<p>
"Oriko-onee-chan said it would be all right," declared the girl.
</p>

<p>
<i>Of course she did</i>, thought Kyoko.
</p>

<p>
"So, uh&#x2026; Yuma-san, was it?"
</p>

<p>
"No!!" She shook her head. "Yuma-/chan/."
</p>

<p>
"So informal!" said Kyoko. "Yuma-chan, then, would you mind, ah,
letting go of my leg?"
</p>

<p>
Yuma shook her head No. "I've <i>got</i> you now, Kyoko-onee-/chan/," she
declared, "and there is no way to escape my clutches, so I'm, I'm&#x2026;
I'm taking you away to my magical realm and, and, and, I will have my
way with you." She nodded with satisfaction and smiled.
</p>

<p>
A flustered Kyoko ran that statement through her mind half a dozen
times, trying to understand the implications. This was the Southern
Group, though, legendary for violence and depravity. And here before
her was a cute little girl, <i>completely at their mercy</i>.
</p>

<p>
"Okay, what the <i>hell</i> have these wierdoes been doing to you in
there?" she cried in outrage. "Listen, Yuma-chan, if those wierdoes
have hurt you &#x2013; so help me, if they have so much as laid a <i>finger</i>
on you &#x2013; I will end them all, and burn this place down to the
ground!"
</p>

<p>
Yuma let go suddenly and fell on her bottom, aghast.
</p>

<p>
"Wha.. no! <i>nooooo!</i>" She scrambled backwards for a moment, trying to
get to her feet, and in a flash of green had transformed into her
costume. "You won't do <i>anything</i> to Oriko-onee-chan without - without
going through me!"
</p>

<p>
Kyoko took a moment to blink.
</p>

<p>
Yuma hissed.
</p>

<p>
"Whoa, hey, I - I'm sorry, this is some kind of misunderstanding. I'm
sorry!"
</p>

<p>
"Not as sorry as you're going to be!" retorted the grade-school girl,
pointing her staff at Kyoko. It wasn't very scary looking for a
weapon, a large white fuzzy sphere with a cat-tail on the end of a
stick, almost as ridiculous as her cat-ear bonnet with green pigtails
sticking out. Still, it's generally a mistake to judge a magical girl
harmless on looks alone, and a thing like that, well &#x2026;  there was no
telling what it could do; at least you knew what you were getting with
a pointy stick.
</p>

<p>
<i>Smooth move, me</i>, thought Kyoko. <i>How do I de-escalate this?</i>
Probably best not to transform.
</p>

<p>
"Hey, now, let's not fight! Especially out here on the street. I was
just here to visit Oriko!"
</p>

<p>
"Then why did you say you were going to hurt her?" She pointed the
staff at Kyoko, accusingly.
</p>

<p>
"It's, uh, hard to explain - well, <i>normally</i> little girls don't hear
things like that, unless someone's doing bad things to them. Where did
you learn to say things like that?"
</p>

<p>
Yuma stood thinking. A few different thoughts came together in her mind.
</p>

<p>
"Oh," she said. "I guess&#x2026; huh. Oriko said it was trouble too."
</p>

<p>
"Yeah, big trouble. I'm just worried they might have been&#x2026; doing bad
things to you. Hurting you."
</p>

<p>
"Oh&#x2026;" She tensed. "bad things &#x2026; no &#x2026; not anymore." She looked
up. "Oriko <i>saved</i> me&#x2026; from bad things." She nodded her head, and
her pigtails wobbled.
</p>

<p>
"Oh thank <i>god</i>," said Kyoko, relaxing. <i>That would be one nightmare I
didn't need in my life.</i> "Can I see Oriko, though?"
</p>

<p>
Yuma pondered briefly.
</p>

<p>
"Okay, but &#x2026; <i>I'm keeping my eye on you</i>, Kyoko - onee - <i>chan!</i>"
</p>

<hr  />

<p>
Oriko was waiting in the garden when Yuma opened the gate.
</p>

<p>
"Watch out!" declared the little girl. "This one is Trouble."
</p>

<p>
"Oh goodness," said Oriko, pouring some tea. "Was there a slight
misunderstanding?"
</p>

<p>
"Yeah, something like that," said Kyoko. "Bet you saw it coming, too,
didn'tcha? Real funny."
</p>

<p>
"While I am guilty as charged," said Oriko, setting down the teapot,
"I assure you that it is nothing to laugh about."
</p>

<p>
"Uh-huh. Mind giving me an explanation, then?"
</p>

<p>
"In just a moment," said Oriko. "First, though, there is a small
matter to attend to."
</p>

<p>
"Oh yeah, what's that?"
</p>

<p>
"Yuma-chan, if you will?"
</p>

<p>
Yuma fished around in a pocket, withdrawing a weathered old skeleton
key. With a reverent gesture, she carefully inserted it into the iron
garden gate, closed her eyes, and turned it shut. A shimmer of green
filled the air around them, magical energies tracing their way along
the rosebushes of the garden wall, leaping into the sky to draw, in
ethereal colors, a shifting mosaic of flower outlines in the sky.
</p>

<p>
"&#x2026; Huh. Now that's real pretty," observed Kyoko.
</p>

<p>
"As an explanation," said Oriko, "this is Yuma-chan's magical realm."
</p>

<p>
"Oh." She looked around. Not just the sky, but everything seemed just
a little more magical. The wrought-iron garden chairs, already fancy,
had turned to ivory and gold, and the scent of the roses was&#x2026; not
stronger, but somehow more exquisite, elaborate. Magical.
</p>

<p>
"It's a secret garden," explained Yuma. "It's for telling secrets."
</p>

<p>
"Secrets?"
</p>

<p>
"While we are in here, we have absolute privacy," explained Oriko. "No
recording devices will work. No magic can see what we are doing. Even
Kyubey cannot materialize here. One could force their way in, yes, but
we could tell. Speaking of which," she turned to Yuma. "Yuma-chan, my
dear, would you mind stepping away for a bit?"
</p>

<p>
"But - but - I just <i>got</i> her here!" objected Yuma.
</p>

<p>
"Sakura-san might have occasion to call me things that a young lady
shouldn't hear. Besides, there will be plenty of time for you two to
play later, I promise."
</p>

<p>
"Hmmph. There'd better be!" she declared, marching off.
</p>

<p>
"Now. Won't you have some donabe?" inquired Oriko.
</p>

<p>
Kyoko sat down, helping herself to some food. "Privacy, huh? Sounds
handy, but, uh, it's a little paranoid, isn't it?"
</p>

<p>
"Oh, no, not in the least," said Oriko. "The Incubators have been such
<i>terrible</i> busybodies. Besides that, there's a magical girl who keeps
spying on people's conversations, usually before they even
happen. Even when she's in the conversation herself, later. Quite a
bother, really. I thought I'd keep her honest for a bit. Has a lovely
hat, though, if I do say so myself."
</p>

<p>
"Huh? Wait a minute," objected Kyoko. "I thought your whole <i>deal</i>
was knowing the future. So why?"
</p>

<p>
"Why would I want to have a conversation where I don't already know
how it ends?" asked Oriko. "What a terrible thought! I must just like
a challenge. Perhaps I'm some sort of a masochist."
</p>

<p>
"A masochist, eh? Can't say I'd be surprised, with some of the company
around here."
</p>

<p>
"Oh my. How do the cool kids say it these days, now? <i>Sick burn</i>,
Sakura-san. But perhaps you'll fit in! We could find room here for a
juvenile delinquent with a death wish."
</p>

<p>
"Death wish! I'm still alive, ain't I?" she demanded with a glower.
</p>

<p>
"Ah, that's right, I'm sorry. In the interests of group harmony, I
should refer to it as a Tendency to Thrill-seeking behavior."
</p>

<p>
"Okay, do you just spy on all our team meetings?" asked Kyoko, a
little annoyed.
</p>

<p>
"I prefer to spend my attention on matters that shape the future of
humanity, affairs of truly earth-shattering importance. Do you fancy
your team the center of the universe?"
</p>

<p>
"No, I think you're a little bit full of it, and a petty eavesdropper,"
said Kyoko, dismissively.
</p>

<p>
"Well, you're be wrong."
</p>

<p>
"<i>Definitely</i> an eavesdropper, though."
</p>

<p>
"You're wrong about the Mitakihara Four. You are <i>definitely</i> the
center of the universe. I've checked. Akemi-san, perhaps, slightly
more than the rest of you."
</p>

<p>
"Like hell we are," said Kyoko. "Besides, it's only <i>three</i> of us now.
Two and a half, maybe, if I'm taking a vacation."
</p>

<p>
Oriko's smile dropped. "Yes, how lovely, a vacation! And to think, you
can take as many as you like, wander through the world as you will,
heedless of demons and other girl's territory, fearless! Fate is on
your side, Kyoko. Did it ever cross your mind to ask the oracle how
long you would live, how you were fated to die?  Because she really
can't tell you. You're <i>special</i>."
</p>

<p>
"Like hell I am," Kyoko retorted. Wait - she was repeating herself.
"What is this? Are you trying to butter me up to sell me on some sort
of a contract? Been there already; thanks."
</p>

<p>
"Simply put, Sakura-san, I am jealous. I've seen some of the ideas
that the future has in store for me. Now, this may make me a bit of a
sentimentalist, but I thought the one where little Yuma seized my
tools, betrayed me, staged a demon attack and joined <i>your</i> team was
particularly compelling."
</p>

<hr  />

<p>
Yuma played by the koi pond while her two onee-chans had an important
conversation. She was entertaining mixed feelings on the matter. Oriko
had promised that Kyoko-onee-chan would really like her and they'd be
very good friends and do lots of fun together. But when she showed up
she said she'd do mean things to Oriko. But maybe she didn't mean it.
And she liked the garden.
</p>

<p>
But she had really wanted to take Kyoko to her magical realm so they
could play together and have lots of fun, and that was kind of ruined.
</p>

<p>
She poked at surface of the fish-pond like a bored cat. <i>Which is
good</i>, she considered, <i>because my costume is like a cat, and so
there's syn&#x2026;</i> syner-somethings, or so Oriko had said, <i>and it makes
your magic happy</i>. Then you could do better enchantments. And Yuma was
going to be the bestest enchantress ever. Oriko had promised.
</p>

<p>
She also promised was going to be a lot of hard work, though. This
wasn't as fun. She swatted at the surface of the pond in
annoyance. <i>Splash.</i>
</p>

<p>
"Hey," said a fish in the koi pond. "Stop that. I'm trying to
rehearse."
</p>

<p>
"I'm sorry!" said Yuma. She stopped.
</p>

<p>
"It's too late now," said the fish. "You've broken my concentration."
</p>

<p>
Something seemed a little bit off.  Granted, fish were not normally
supposed to talk, but this was a magic garden, so while it wouldn't do
to ask too many questions, it wouldn't do to ask too few, either. Not
for a big enchantment, anyway.
</p>

<p>
"It looked like you were just going in circles."
</p>

<p>
"Yes, and I lost count. Round and round and round she goes!" said the
fish. Or was she a mermaid? It was hard to tell, looking at her; she
was more like a shadow than a proper shape. "Where she'll stop, nobody
knows!"
</p>

<p>
"What's your name?" she asked the shadow of a fish.
</p>

<p>
"Call me D-ko. Do you think I've done enough circles?"
</p>

<p>
"How many is enough?"
</p>

<p>
"As few as eternity, as many as the embryo of philosophy.
Counter-clockwise, of course."
</p>

<p>
Yuma pondered. "That sounds like a lot more circles than I saw."
Eternity seemed like it would be a lot of circles.
</p>

<p>
"Maybe if I go faster, then," said D-ko.
</p>

<p>
"Slow down, you'll make a whirlpool," objected Yuma. The water was
whirling about already, and Yuma did <i>not</i> like the look of it.
</p>

<p>
"Ah, it is empty motion! Just empty motion!" cried the fish, whirling
around at a most furious pace.
</p>

<p>
Yuma backed away from the koi pond. She didn't want to get sucked in
by a whirlpool. It seemed like a good way to get wet. Best to go back
to Oriko. It should be just around the next corner &#x2026;
</p>

<hr  />

<p>
Kyoko was regretting having come, but was trying to keep her cool, at
least until she was done eating. The food was her excuse for coming,
too, and she didn't want to give Mami and Homura something to gloat
about. The conversation had degenerated, however.
</p>

<p>
"I won't deny it for a moment," said Oriko, replying to a point Kyoko
had made about Yuma. "They are all absolutely terrible role models for
her."
</p>

<p>
"I'm surprised an ojou-sama like yourself would even hang around with
that crew." she said. "How'd you convince <i>any</i> of them to join a
team? Especially Hinata Aina. More importantly, <i>why?</i>"
</p>

<p>
Oriko paused.
</p>

<p>
"You know, for all our conversation the other day," she finally said,
"there is one thing you never really answered. Whether you really
believe God is real, or if you just go back for other reasons."
</p>

<p>
"Truth?" asked Kyoko. "I'm kinda taking it a day at a time on the
matter."
</p>

<p>
"Is today one of those days?"
</p>

<p>
Kyoko took a sip of tea. "Well, there's a cute little girl who <i>isn't</i>
in nearly as much trouble as I thought she might be. I'm giving it a
definite Maybe right now."
</p>

<p>
"I see," said Oriko.
</p>

<p>
"What about it?" asked Kyoko.
</p>

<p>
"Tell me, Sakura-san. When God decided to save the world, where did he
begin? Did he by saving the nobility? The pretty princess ojou-samas
with nice clothes? The politician's daughters?" She looked Kyoko in
the eye. "Or did he start by making friends with the thugs, the
prostitutes, and the rough men who slept out in the fields with the
sheep?  Did he come to save the prosperous, or the insane and broken
people?"
</p>

<p>
Kyoko blinked. A dozen different replies leapt to mind, but they were
all half-formed, and most of them &#x2026; most of them were probably
better arguments <i>for</i> Oriko here than against her, if you got down to
it. <i>Damn it</i>, she thought. She was supposed to be good at this stuff,
but she was <i>badly</i> out of practice. More importantly, it was all
backwards. <i>She</i> was supposed to be the one on that side of the
argument.
</p>

<p>
In the daze of her confusion, Oriko pressed her argument.
</p>

<p>
"Consider little Yuna-chan. Her father was going to sell her to the
Yakuza. We saved her. Before that, she was abused. Her mother would
sometimes burn her face with cigarettes. On the forehead, under her
bangs, so no one would see. And we stopped them. We kept Yuma-chan
safe," said Oriko. "Now, the question I have for you is this: What if
Yuma-chan were not so cute? What if she were a little older? Suppose
she had an attitude. When would you say that she no longer deserves a
second chance at life?"
</p>

<p>
<i>Ah</i>, thought Kyoko, <i>the Devil himself can quote scripture, but&#x2026;</i>
<i>damn, how do I put it?</i>
</p>

<p>
Oriko was finishing her argument. "If God were to save only pure and
perfect people, if the world only had room for such as these, the only
place for me would be at my father's side, spending the rest of my
decades in prison."
</p>

<p>
"You know," said Kyoko, picking her final approach to the argument,
"there's something to that. But the idea of being <i>saved</i> is that you
work yourself to, like, <i>stop sinning</i>. You don't threaten people and
tell them you're going to be running their spleen through a cheese
grater."
</p>

<p>
"Oh dear," said Oriko. "That would have been Kirika-chan, then,
wouldn't it."
</p>

<p>
"That's the one. Where is she, anyway?"
</p>

<p>
"She's <i>out</i>, at the moment. For what it's worth, I'm working hard to
keep her out of trouble, <i>and</i> helping people."
</p>

<p>
"Uh-huh. Sure."
</p>

<p>
"In the beginning," said Oriko, "Kirika and I were chronically short
on grief cubes and did what we had to, to keep alive. And you or
anyone would have done the same, and you know it. It's different
now. We have a nearly full team, we have Yuma-chan is here to help the
fighters recover. We hunt the demons that other teams would have never
noticed, and stay out of the way. We are prosperous and efficient. The
time for viciousness and fighting other teams is behind us. We have a
sustainable cycle, and make a tidy little profit. I forecast the demon
spawns, the hunters track them down, and Yuma keeps us well. We step
on fewer ties."
</p>

<p>
"Forecasts, huh." Kyoko swallowed some donabe. "That sounds pretty
useful." She pondered a little.
</p>

<p>
"Yes, it's an excellent scheme," said Oriko. "And it works, and I can
take it further. I'm hoping to cooperate with other teams, trade
information for cubes. I could easily double what magical girls
harvest in Mitakihara. Unfortunately, it all runs through me."
</p>

<p>
"What's unfortunate about that?" asked Kyoko.
</p>

<p>
"I only have so much attention," said Oriko, "and saving the magical
girls of Mitakihara is not enough. I intend to save the whole world,
not just the part where I live. What we <i>really</i> need is statistical
modeling, something we can do without magic. It's frustrating, though.
I've seen it in action, but I don't understand it well enough to
re-create it here."
</p>

<p>
"Wait a second," said Kyoko. "You can <i>do</i> that? Predict demon spawns
with&#x2026; statistics?"
</p>

<p>
"In theory. Demons feed on human emotions, so it's essentially applied
psychology and demographics."
</p>

<p>
"Huh," said Kyoko. "That's &#x2026; a really neat idea."
</p>

<p>
"Oh, that's <i>Akemi-san's</i> idea. I'm just stealing it. But I don't know
quite enough math to make it work. Of course, <i>she</i> doesn't know
enough yet either."
</p>

<p>
Kyoko looked at Oriko askance. "So let me get this straight. You can
see the future, but you anything about it because you <i>don't know
enough math</i>?" she inquired, on the edge of laughter. "That could be
the funniest thing I ever heard."
</p>

<p>
Oriko grinned. "You think statistics are bad? Three words for
you. <i>Quantum field theory</i>."
</p>

<p>
"Aw, <i>hell</i> no."
</p>

<p>
"<i>I have Feynman diagrams on my writing desk right now.</i>"
</p>

<p>
Kyoko shuddered. "I don't even know what that <i>means</i> and I want
nothing to do with it."
</p>

<p>
"And that's just the start. I've been copying engineering diagrams and
schematics from memory for a <i>month</i>."
</p>

<p>
"Wait, schematics?" asked Kyoko. "You're trying to invent something
from the future?"
</p>

<p>
"It's a long story," said Oriko. "The gist of it is that I'm trying to
invent something so that <i>I don't have to do this anymore.</i> But it
gets worse before it gets better." She pressed her hands together for
a moment.  "Worth it, though." She smiled.
</p>

<p>
"What's the payoff?" asked Kyoko.
</p>

<p>
The smile dropped.
</p>

<p>
"It's &#x2026; an end to a very bad business, hopefully," said Oriko. "I
&#x2026; shouldn't say, not right now."
</p>

<p>
Something about her manner seemed familiar. <i>She's a lot like
Akemi-san</i>, realized Kyoko, <i>when you get too close to one of her
little secrets</i>.
</p>

<p>
Kyoko's thoughts were interrupted Yuma as returned, out of
breath. "Kyoko-onee-/chan/!"
</p>

<p>
"Hey, squirt," said Kyoko, "what's up?"
</p>

<p>
"I was at the pond and I talked to the fish and she was swimming
around in circles and she said, she said -"
</p>

<p>
"Wait, the fish talked?" asked Kyoko.
</p>

<p>
"What part of <i>magical realm</i> don't you understand?" asked Yuma.
"Anyway she was going <i>way too fast</i> so I came back but I got lost on
the stairs on the way back."
</p>

<p>
Kyoko glimpsed in the direction Yuma had come from.
</p>

<p>
"I don't see any stairs. What kind of a magical realm are you running
here?" asked Kyoko.
</p>

<p>
"It's a pocket!" said Yuma.
</p>

<p>
"A pocket?" Kyoko was confused.
</p>

<p>
"A pocket universe," amended Oriko. "Small worlds like this are
useful, but the space likes to loop back around on itself, and they're
quite sensitive to build-ups of emotional energy&#x2026; especially with
three magical girls inside them, and not much else."
</p>

<p>
"You do this often?" asked Kyoko.
</p>

<p>
"This is Yuma's second time. We practiced before you came. But there's
a rather sophisticated book on the subject of enchantments that will
tell you all about pocket realms. It's an excellent read - one of the
foundational texts on magic, really."
</p>

<p>
Kyoko considered. "I don't remember <i>ever</i> hearing anything 'bout any
books on mag &#x2013; hey! Is this another one of your &#x2026; your future
things?!?"
</p>

<p>
"But of course. It's one of the reasons I'm teaching Yuma-chan all
about magic."
</p>

<p>
Yuma nod-nod-nodded. "When I grow up I'm gonna be a beautiful
enchantress."
</p>

<p>
"Izzat so," said Kyoko.
</p>

<p>
"Mmm-hmm! And we're going to be <i>best friends</i>, and go on adventures!"
</p>

<p>
"Oh. What <i>kind</i> of adventures?" Kyoko asked Yuma, with a wary glance
at Kyoko.
</p>

<p>
"We can be, we can be, we can be Elite Secret Agents, saving the world
from certain annihil - uh, annihilation, at the hands of an extra - an
extra-terrestial menace!" Yuma beamed.
</p>

<p>
"Yuma-chan, you're not old enough to be an elite secret agent yet,"
said Oriko.
</p>

<p>
"I thought you were going to be a beautiful enchantress?" asked Kyoko.
</p>

<p>
"A f - femme fatale!" said Yuma.
</p>

<p>
"Does this have anything to do with Mikune-san's little recruitment
pitch, and why she asked me here today?" asked Kyoko.
</p>

<p>
"Actually, I was hoping to ask you for help with an errand," said Oriko.
"After <i>that</i>, we're going to be taking down the Yakuza."
</p>

<p>
"Taking down the - are you out of your mind??!" exclaimed Kyoko.
</p>

<p>
"Well, it's another stolen idea, but <i>you</i> came up with this one."
</p>

<p>
"When did I do <i>that?</i>"
</p>

<p>
"&#x2026; I want to say, 2040? Maybe 2045? I don't remember the date
specifically," said Oriko.
</p>

<p>
"In what alternate universe is a magical girl like me still <i>alive</i> in
30 years?" demanded Kyoko.
</p>

<p>
/"In my universe, Sakura-san,"/ said Oriko.
</p>

<hr  />

<p>
In a more northerly portion of Mitakihara, three girls and an
Incubator met on the school roof at the end of class.
</p>

<p>
"Ahh, good afternoon, Tomoe-senpai, Homura-chan" said Hitomi.
</p>

<p>
"Good afternoon, Shizuki-san. Welcome to the Mitakihara Three," said
Mami. "We're glad to have you on the team."
</p>

<p>
"Mitakihara Four," said Homura. "I saw Sakura-san this morning. She
should be here by nightfall&#x2026; well, probably, anyway."
</p>

<p>
"Probably?" inquired Mami.
</p>

<p>
"She's having <i>dinner</i> with <i>Mikune Oriko</i>," said Homura.
</p>

<p>
"So she might be late?" asked Hitomi.
</p>

<p>
Mami and Homura glanced at one another.
</p>

<p>
Kyubey piped up from his perch on Hitomi's shoulder. "The Southern
Group have a history of conflict, especially with the Mitakihara
Four. I believe miss Akemi is concerned for miss Sakura's safety."
</p>

<p>
"Since you already know about Sayaka-chan," said Mami to Hitomi,
"there's no point in candy-coating it. Magical girls can die in
combat. In fact, it's quite common. It's one reason why we have
teams. And it's not just a question of fighting demons; teams fight
each other over territory. Oriko's team is notoriously violent.
They've ganged up on girls, stolen their grief seeds, and left them to
die at the hands of demons. They've given a lot of groups a lot of
trouble, us especially."
</p>

<p>
Shizuki Hitomi nodded, solemnly. "Oh."
</p>

<p>
"I thought you said you wouldn't candy-coat it," said Homura. "I have
no doubt that they have killed girls with their own hands."
</p>

<p>
Mami sighed. "Right. I wouldn't doubt it."
</p>

<p>
"Kyoko-chan has been on a reckless streak since Sayaka-chan met with
her untimely end," explained Homura. "While the rest of us had a fine
working relationship with her, Sayaka was perhaps the first person she
had gotten close to in a rather long time, despite their conflict of
personalities - or perhaps, <i>because</i> of it. It culminated in Kyoko
leaving town, under the auspices of 'wandering the wilderness'. But
it's not safe to be a lone wolf, as a magical girl, especially not in
someone else's territory."
</p>

<p>
"Being part of a team is what keeps us alive," said Mami, "especially
when you're new. So it's very important. Fortunately, we're quite
friendly - even Akemi-san! She's just intense."
</p>

<p>
"We are also understaffed, with or without Kyoko-chan." added Homura.
</p>

<p>
Mami nodded. "So we're very glad to have you."
</p>

<p>
"Oh, thank you so much," said Hitomi. "I'll work hard to do my best."
</p>

<p>
"That's the spirit," said Mami. "Your magic will generally teach you
the basics of how to fight. What it won't really teach you is tactics,
and how to work with someone else. Which brings me to the next
point. We're all on the same team here, so we're kind stuck with
another whether we like it or not. And we're going to go out there,
every night, and put our lives into each others' hands. So it's
important not to make this any harder than it has to be. We <i>need</i> to
get along with each other; we simply can't afford to fight with
ourselves."
</p>

<p>
"To be fair," said Homura, relaxed against the wall and idly leafing
through a mathematics textbook, "a magical girl <i>can</i> take on demons
by herself and win, almost every single time. But do not let that fool
you into complacency. But when there is only one of you, it likewise
only takes one mistake to die, and every fight is an opportunity to
make that mistake. To leave your team is to invite death."
</p>

<p>
Mami nodded. "We place a lot of value on group harmony. You'll hear us
say it a lot."
</p>

<p>
"In order to survive," said Homura, "we must accept and value each
other, even as flawed and fallen people. And in order to thrive must
put aside our differences and be fast friends. The brutal reality of
our shared fate will put to lie many conceits and fantasies, but in
one, we can yet find solace: that no matter what, our strongest arms
in any fight are the sword of Love, the shield of Hope, and the armor
of Friendship." She closed her book.
</p>

<p>
"Oh my, Akemi-san," said Mami. "That's &#x2026; that's quite lovely."
</p>

<p>
"It's harsher than it sounds. Not everyone can handle the true meaning
of friendship. May the goddess preserve you, that you not be put to
the test."
</p>

<p>
"The goddess?" said Hitomi? "Oh -"
</p>

<p>
"In the interest of group harmony," said Mami, "we do not tease
Akemi-san about her beliefs, and cherish them as part of her
irreplaceable character, accepting her <i>unique</i> blessings with grace."
</p>

<p>
"Ah, um &#x2026;" Hitomi made a face. "Thank you, Akemi-san."
</p>

<p>
"Please, Hitomi-chan. We are friends now. Soon, we will be <i>close</i>
friends. This is my friendly disposition, I assure you."
</p>

<p>
"&#x2026; Homura-chan?" asked Hitomi, tentatively.
</p>

<p>
Homura actually smiled. "Thank you, Hitomi-chan. You will be in good
hands here."
</p>

<hr  />

<p>
Oriko pushed aside the Feynman diagrams, pulled out a notebook, and
began writing. <i>Yuma-chan greeted Kyoko with remark about magical
realms.</i> <i>Probably imitating Miroko-san.</i> <i>Used Kyoko's distress at
this to pitch salvation story for the team&#x2026;</i> The details would take
a while to get down in full, but she should have just enough time
before the others got back.
</p>

<hr  />

<p>
As the sun was set, Kyoko snuck into the school through one of the
side doors that was easy to unlock with a bit of magic.
</p>

<p>
She'd promised Oriko to think about it, nothing more, but questions
gnawed at her. The prophetess had gotten under Kyoko's skin. It
was&#x2026; weird, definitely too much weird stuff going on there. She
wouldn't be comfortable throwing in with a group like that. Besides,
why was she even thinking of it anyway?  She already <i>had</i> a group. It
was high time she got back to them.
</p>

<p>
Certain remarks kept bothering her, though, like the one about the
Mitakihara Four special to fate. If they were so special, why did
Sayaka have to die? And she just wasn't quite willing to believe it
was a mistake. That girl was playing a long game, and she knew
<i>exactly</i> what she was saying. So what did it mean? Oriko wasn't
implying Sayaka was still alive somehow, was she? No. No way. She
couldn't be. Okay, sure, there was no body. But that's normal. <i>You
know better, Kyoko,/ she told herself. /You shouldn't be letting your
imagination run wild.</i> <i>Get real.</i>
</p>

<p>
Her train of thought was interrupted by the door to the roof. It was
locked, which was unusual. Not a real obstacle, of course; another bit
of magic and it was open. But it was <i>never</i> locked.
</p>

<p>
Homura was sitting on the roof, reading, idly stroking the resting
 Kyubey at her side.  Kyoko let the door close itself, with a
 satisfying <i>clunk</i>.
</p>

<p>
"Good evening, Kyoko," said the Incubator, replying to the noise.
"We were wondering when we'd have you back."
</p>

<p>
"Wondering <i>if</i> we would have you back," added Homura.
</p>

<p>
"Hey. Am I early or something?" She looked around for Mami. "I mean,
sure, I didn't expect a big welcome-back party or anything, but
locking the door in my face?"
</p>

<p>
"My apologies. We thought a little bit of extra privacy was in order
today," replied Homura.
</p>

<p>
"Where's Mami?" Kyoko inquired, taking a look at what Homura was
reading. It was a mathematics text. On a second inspection, it was a
university-level mathematics text, <i>Intermediate Statistics</i>.
</p>

<p>
"She'll be back soon, but she's off playing senpai right now. It's her
favorite."
</p>

<p>
A sparkle of magic glimmered in the distance. Mami, and &#x2026; someone
unfamiliar. Kyoko understood. The Mitakihara /Four,/ Oriko had said.
</p>

<p>
"Oh, that is <i>cold</i>, Homura" said Kyoko. "Sign up a new girl to the
team when I'm gone, sure, <i>fine</i>. That's the price I pay. But you
could have said something about it this morning."
</p>

<p>
"Oh, a funny coincidence, that," said Homura, turning a page -
</p>

<p>
<i>Incoming!</i> came a telepathic shout.
</p>

<p>
A magical seal formed itself on the roof around them, an elaborate
fractal of delicate green lines and flowers. The surface of the roof
glowed bright white. From the distance, a yellow-green projectile
arced up, heading towards the school, leaving a trail of light behind
it. As it drew closer a <i>non</i>-telepathic scream grew louder &#x2026;
</p>

<p>
<b>pouff</b>
</p>

<p>
The energies of the seal released themselves with a flurry of flower
petals, slowing the incoming pair down as they landed on the roof,
tumbling to a stop with a burst of laughter.
</p>

<p>
"That was a <i>little</i> more energetic than I had in mind," said Mami,
looking at the sky from on her back. "Nice catch, though."
</p>

<p>
"You said&#x2026; you said <i>get us both out of here fast</i>, and to go
somewhere <i>safe</i>," replied Hitomi, picking herself up.
</p>

<p>
"Well, I suppose you delivered!"
</p>

<p>
Kyoko stared at the interloper. She had just materialized a tall
silver staff with a great green gem on top to help her to her feet.
With this she wore a flowing, floor-length dress, green with white
trim, that was pleated down the center with extra folds of fabric. The
bodice, set off from the skirt with a ruffly pleplum, was adorned with
military style details: large buttons, decorative waist pockets,
shoulder pads with tassels, and a little cord which made a loop from
her right shoulder to the center of her chest, just below her soul
gem. The top was was sleeveless, but there were showy cuffs at her
wrist, held in place by goodness-knows-what - probably just magic,
actually. Her hair was in an elaborate up-do, just a trifle
dishevelled from her flight, held in place with a five-point <i>tiara</i>.
</p>

<p>
"Sakura Kyoko, this is Shizuki Hitomi," offered Kyubey. "She just made
her contract yesterday evening."
</p>

<p>
"Oh, I know who <i>she</i> is," said Kyoko. "She's that violin boy's little
princess, isn't she. Isn't that special."
</p>

<p>
<i>Special. Favored by fate.</i> <i>Not like the girl she's</i> replacing,
<i>obviously.</i> <i>Fate would never give a crap about</i> her.
</p>

<p>
"Ah!" said Hitomi, still catching her breath. "Sakura-san. Very
pleased to meet you."
</p>

<p>
"So tell me, princess, what did <i>you</i> wish for?" demanded Kyoko.
</p>

<p>
Homura looked up at her, surprised at her tone.
</p>

<p>
"Uhm," said Hitomi, surprised at the sudden attention, "I just &#x2026; I
just wanted to do right by Sayaka-chan."
</p>

<p>
"Aww <i>hell</i> no," said Kyoko.
</p>

<p>
"Kyoko?" inquired Mami. "Is everything all right?"
</p>

<p>
"Hell no," repeated Kyoko. "Fuck this noise."
</p>

<hr  />

<p>
"Whoops!" said Kirika. "Looks like you're fresh out of grief
cubes!"  She dangled the stolen pouch full of treasure by its strings,
feeling its weight. " A pity! You've been saving up, haven't you? How
<i>responsible!</i> Your mentors would surely be pleased."
</p>

<p>
"Unfortunately, they can't help you <i>now</i>, little bitch," added Hinata
Aina.
</p>

<p>
Miroko Mikiru gazed into the trapped girl's eyes. "There is no way to
escape my clutches. Your soul is forfeit," she declared, holding aloft
the gem, freshly pried from the girl's costume. She fended off a few
more attempts at biting and jumped back.
</p>

<p>
Nakanishi squirmed in panic and in pain. "What are you &#x2026; what are
you <i>doing?</i>" This was bad. She was completely at their mercy and, by
all rights, ought be dead by now. That she somehow <i>wasn't</i> (and was,
instead, merely separated from her soul gem and trapped in Mikiru's
ice cube prison up to her elbows) was perhaps <i>more</i> distressing than
the alternative. And the grief cubes - if it were just hers, that
would be one thing, but Nagisa-chan had been so generous with them.
Perhaps if she could free just one hand&#x2026;
</p>

<p>
"It's just what she said," Kirika explained, nonchalantly. "Your soul
is forfeit. It belongs to us now." Kirika <i>liked</i> explaining. It was
so much fun.
</p>

<p>
"I wonder what Oriko-san wants to do with it," said Aina, grinning. "I
can't even begin to imagine. The possibilities are endless."
</p>

<p>
"Well, regardless," said Kirika. "It's the <i>soul</i> she wants; we can
just leave her <i>body</i> here. We definitely don't need <i>that</i>."
</p>

<p>
"You know," said Aina, looking out the window, "there are boats out
there in the park."
</p>

<p>
"What &#x2026; what does that have to do with anything??" asked Nakanishi,
unable to concoct an appropriately depraved nautical scenario.
</p>

<p>
"I'm thinking, Viking funeral," replied Aina. "We can do burning <i>and</i>
drowning at once. A beautiful way to go. Sheer poetry."
</p>

<p>
"No," declared Mikiru. "The ice would float. Or it would melt, and she
would go free. Besides, it would drain her gem, and we want it
intact. You can do it to dispose of the body, though. I will go on
ahead with the soul."
</p>

<p>
"What do you mean?" demanded the prisoner.
</p>

<p>
Kirika leaned her back against the ice cube as Mikiru strode out of
the building. "Listen. What's-yer-name. You're pretty new to the
magical lifestyle, right? So I'm guessing your friends never told you
how if a magical girl is more than 100 meters from her soul gem, her
body goes limp, and she blacks out?"
</p>

<p>
"What?!? That's &#x2026; that's crazy. Why would that happen?"
</p>

<p>
Kirika smiled. "Because it's your <i>soul</i>, silly!"
</p>

<p>
While Nakanishsi's eyes went wide in horror, Kirika reached out and
put a finger to the trapped girl's nose. "Boop!" Then the body went
limp.
</p>

<p>
"A classic performance," opined Kirika, with a golf clap. "The look on
her face!"
</p>

<p>
"I'll go take care of the body," said Aina. "Don't you have an
appointment?"
</p>

<p>
"Crap," said Kirika. "What time is it?"
</p>

<hr  />

<p>
When Kirika arrived at her appointment - on a rooftop, several miles
away from the school - she found Kyoko was sitting by herself, looking
out over the city. It looked she was pretty bothered about something.
But the redhead interrupted her seething to whirl about and point a
spear at her her neck.
</p>

<p>
"Hey, cool it, pocky-brains," said Kirika. "I come in peace."
</p>

<p>
"Like hell you do," said Kyoko.
</p>

<p>
"Got something for you from Oriko." She tossed a small pouch to Kyoko,
and it landed at her feet. "Payment up front. No strings attached.
Except the strings of fate, obviously. Always got those."
</p>

<p>
"I told her I'd <i>think</i> about working with her."
</p>

<p>
"Yeah, well, you just thought about it, didn't ya, so now I'm here,"
said Kirika. "Got some more things for you, too."
</p>

<p>
"Your boss couldn't be bothered to come out here herself?" asked
Kyoko.
</p>

<p>
Kirika laughed. "That's not how it works, new girl. Everything's all
planned out in advance, so that Oriko can check that it all still
works. You'll never talk with her <i>during</i> a mission. That could mess
it up."
</p>

<p>
Kyoko bent down, cautiously, to pick up the sack. That was&#x2026; a very
good number of grief cubes, actually.
</p>

<p>
"I guess you have my attention. What's this errand?"
</p>

<p>
"Deliver a letter," said Kirika, "and make two purchases at a certain
convenience store."
</p>

<p>
"All this to play errand girl? What's the catch?"
</p>

<p>
Kirika reached out and offered Kyoko a slim envelope. She accepted it,
warily, peeked inside.
</p>

<p>
"What is this? Plane tickets?"
</p>

<p>
"You're going to Amsterdam."
</p>

<p>
"Like hell I am! Hell, I don't even have a passport."
</p>

<p>
Kirika pulled out a larger envelope. "Sure you do. It was sitting in a
fire safe in a church in Kazamino."
</p>

<p>
Kyoko snatched it, angrily. "What the hell? You were going through my
stuff?"
</p>

<p>
"Could be," shrugged Kirika. "You kind of just left it there, though,
you know? Didn't seem like you cared for it that much."
</p>

<p>
"Why Amsterdam?" demanded Kyoko.
</p>

<p>
"How's your English?" asked Kirika.
</p>

<p>
"It's crap. What does that have to do with anything?"
</p>

<p>
"They get lots of tourists there and they're pretty good with
English. How's your French? German? Any better?"
</p>

<p>
"Hell no," said Kyoko.
</p>

<p>
"Well there you go."
</p>

<p>
Kyoko rummaged around a bit and extracted a stack of bills from the
envelope, euros, mostly fifties. It was a <i>lot</i> of cash.
</p>

<p>
"Petty cash for expenses," said Kirika. "There's also a debit card,
prepaid; you're supposed to get yourself something nice while you're
over there. Treat yourself, just keep to the itinerary. If anyone
asks, you're doing a self-directed study on cathedral architecture.
There are some on the itinerary, by the way. You take the bullet
train, head back via Paris, swing by Notre Dame along the way."
</p>

<p>
"What."
</p>

<p>
"Oh, and you get a gadget. Catch." She tossed Kyoko a small object.
</p>

<p>
"What's this?" It was a tetrahedron, black, with a white 0 inscribed
on all each face.
</p>

<p>
"Grief cubes freak out the X-ray machines, so the airport security
wants to go through them all by hand. You put that little toy in with
them and they all disguise themselves as dice." Kirika grinned.
"Pretty neat, huh?"
</p>

<p>
It <i>was</i> pretty neat. <i>Elite secret agents, huh?</i>
</p>

<p>
"I'll think about it," said Kyoko.
</p>

<p>
"Better think fast. Flight's in three hours."
</p>

<p>
"What the hell? Am I supposed to just sleep on the plane?"
</p>

<p>
Kirika shrugged. "It's what, a twelve hour flight? You were probably
gonna do that anyway. Besides, isn't it supposed to be first class?
That's supposed to help with the grief cubes at security, too. You
get the special line and they don't ask as many questions."
</p>

<p>
"Holy shit," said Kyoko, checking the ticket again. She looked up at
Kirika. "Seriously. Is all this actually <i>normal</i> for you guys?"
</p>

<p>
"The cloak-and-dagger? Kind of. It's been getting more fun. This one's
a little over the top, though." Kirika beamed. "The look on your face
is <i>amazing</i>."
</p>
</div>
</div>
</div>
</body>
</html>
